---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.CapWasAddedWarning
source: html/3afc8d1b-7c97-851f-0d1b-95d6daf88ba0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.CapWasAddedWarning Property

1 cap was added.

## Syntax (C#)
```csharp
public static FailureDefinitionId CapWasAddedWarning { get; }
```